yamamo2shun1/OTO_DEVICES/STM32CubeIDE/USB_HS_TEST/Middlewares/ST/STM32_USB_Device_Library/Class/AUDIO/Src/usbd_audio.c
        /* USB Speaker Audio Type I Format Interface Descriptor (2ch, 24-bit, 48kHz) */
        0x0B,                               /* bLength */
        AUDIO_INTERFACE_DESCRIPTOR_TYPE,    /* bDescriptorType */
        AUDIO_STREAMING_FORMAT_TYPE,        /* bDescriptorSubtype */
        AUDIO_FORMAT_TYPE_I,                /* bFormatType */
        USBD_AUDIO_CHANNELS,                /* bNrChannels */
        USBD_AUDIO_SUBFRAME_BYTES,          /* bSubFrameSize :  3 Bytes per frame (24bits) */
        USBD_AUDIO_RES_BITS,                /* bBitResolution (24-bits per sample) */
        0x01,                               /* bSamFreqType only one frequency supported */
        AUDIO_SAMPLE_FREQ(USBD_AUDIO_FREQ), /* Audio sampling frequency coded on 3 bytes */
        /* 11 byte(126)*/

        /* Endpoint 1 - Standard Descriptor */
        AUDIO_STANDARD_ENDPOINT_DESC_SIZE,           /* bLength */
        USB_DESC_TYPE_ENDPOINT,                      /* bDescriptorType */
        AUDIO_OUT_EP,                                /* bEndpointAddress 1 out endpoint */
        USBD_EP_TYPE_ISOC | USBD_EP_ATTR_ISOC_ASYNC, /* bmAttributes */
        AUDIO_PACKET_SIZE_MAX(USBD_AUDIO_FREQ),      /* wMaxPacketSize in Bytes (Freq(Samples)*2(Stereo)*3(HalfWord)) */
        AUDIO_HS_BINTERVAL,                          /* bInterval */
        0x00,                                        /* bRefresh */
        AUDIO_FB_EP,                                 /* bSynchAddress */
        /* 09 byte(135)*/

        /* Endpoint - Audio Streaming Descriptor */
        AUDIO_STREAMING_ENDPOINT_DESC_SIZE, /* bLength */
        AUDIO_ENDPOINT_DESCRIPTOR_TYPE,     /* bDescriptorType */
        AUDIO_ENDPOINT_GENERAL,             /* bDescriptor */
        0x00,                               /* bmAttributes */
        0x00,                               /* bLockDelayUnits */
        0x00,                               /* wLockDelay */
        0x00,
        /* 07 byte(142)*/

        /* Feedback IN Endpoint (Standard, 9B) */
        AUDIO_FEEDBACK_ENDPOINT_DESC_SIZE, /* bLength */
        USB_DESC_TYPE_ENDPOINT,            /* bDescriptorType: ENDPOINT */
        AUDIO_FB_EP,                       /* bEndpointAddress: IN */
        USBD_EP_TYPE_ISOC | 0x10,          /* bmAttributes: Isoch | Usage=Feedback */
        0x03,
        0x00,               /* wMaxPacketSize = 3 bytes (HS:10.14) */
        AUDIO_FB_BINTERVAL, /* bInterval: 1ms (=2^(4-1) µframes) */
        0x00,               /* bRefresh */
        0x00,               /* bSynchAddress=0 */
        /* 09 byte(151)*/

        /* Interface 1, Alternate Setting 2 (96kHz) */
        AUDIO_INTERFACE_DESC_SIZE,     /* bLength */
        USB_DESC_TYPE_INTERFACE,       /* bDescriptorType */
        0x01,                          /* bInterfaceNumber */
        0x02,                          /* bAlternateSetting */
        0x02,                          /* bNumEndpoints */
        USB_DEVICE_CLASS_AUDIO,        /* bInterfaceClass */
        AUDIO_SUBCLASS_AUDIOSTREAMING, /* bInterfaceSubClass */
        AUDIO_PROTOCOL_UNDEFINED,      /* bInterfaceProtocol */
        0x00,                          /* iInterface */
        /* 09 byte(160)*/

        /* USB Speaker Audio Streaming Interface Descriptor */
        AUDIO_STREAMING_INTERFACE_DESC_SIZE, /* bLength */
        AUDIO_INTERFACE_DESCRIPTOR_TYPE,     /* bDescriptorType */
        AUDIO_STREAMING_GENERAL,             /* bDescriptorSubtype */
        0x01,                                /* bTerminalLink */
        0x01,                                /* bDelay */
        0x01,                                /* wFormatTag AUDIO_FORMAT_PCM  0x0001 */
        0x00,
        /* 07 byte(167)*/

        /* USB Speaker Audio Type I Format Interface Descriptor (2ch, 24-bit, 96kHz) */
        0x0B,                                   /* bLength */
        AUDIO_INTERFACE_DESCRIPTOR_TYPE,        /* bDescriptorType */
        AUDIO_STREAMING_FORMAT_TYPE,            /* bDescriptorSubtype */
        AUDIO_FORMAT_TYPE_I,                    /* bFormatType */
        USBD_AUDIO_CHANNELS,                    /* bNrChannels */
        USBD_AUDIO_SUBFRAME_BYTES,              /* bSubFrameSize :  3 Bytes per frame (24bits) */
        USBD_AUDIO_RES_BITS,                    /* bBitResolution (24-bits per sample) */
        0x01,                                   /* bSamFreqType only one frequency supported */
        AUDIO_SAMPLE_FREQ(USBD_AUDIO_FREQ_96K), /* Audio sampling frequency coded on 3 bytes */
        /* 11 byte(178)*/

        /* Endpoint 1 - Standard Descriptor */
        AUDIO_STANDARD_ENDPOINT_DESC_SIZE,           /* bLength */
        USB_DESC_TYPE_ENDPOINT,                      /* bDescriptorType */
        AUDIO_OUT_EP,                                /* bEndpointAddress 1 out endpoint */
        USBD_EP_TYPE_ISOC | USBD_EP_ATTR_ISOC_ASYNC, /* bmAttributes */
        AUDIO_PACKET_SIZE_MAX(USBD_AUDIO_FREQ_96K),  /* wMaxPacketSize in Bytes (Freq(Samples)*2(Stereo)*3(HalfWord)) */
        AUDIO_HS_BINTERVAL,                          /* bInterval */
        0x00,                                        /* bRefresh */
        AUDIO_FB_EP,                                 /* bSynchAddress */
        /* 09 byte(187)*/

        /* Endpoint - Audio Streaming Descriptor */
        AUDIO_STREAMING_ENDPOINT_DESC_SIZE, /* bLength */
        AUDIO_ENDPOINT_DESCRIPTOR_TYPE,     /* bDescriptorType */
        AUDIO_ENDPOINT_GENERAL,             /* bDescriptor */
        0x00,                               /* bmAttributes */
        0x00,                               /* bLockDelayUnits */
        0x00,                               /* wLockDelay */
        0x00,
        /* 07 byte(194)*/

        /* Feedback IN Endpoint (Standard, 9B) */
        AUDIO_FEEDBACK_ENDPOINT_DESC_SIZE, /* bLength */
        USB_DESC_TYPE_ENDPOINT,            /* bDescriptorType: ENDPOINT */
        AUDIO_FB_EP,                       /* bEndpointAddress: IN */
        USBD_EP_TYPE_ISOC | 0x10,          /* bmAttributes: Isoch | Usage=Feedback */
        0x03,
        0x00,               /* wMaxPacketSize = 3 bytes (HS:10.14) */
        AUDIO_FB_BINTERVAL, /* bInterval: 1ms (=2^(4-1) µframes) */
        0x00,               /* bRefresh */
        0x00,               /* bSynchAddress=0 */
                            /* 09 byte(203)*/

        /* ---------------- AS(IN) Interface #2 ---------------- */
        /* Std AS Interface, alt 0 */
        AUDIO_INTERFACE_DESC_SIZE, /* bLength */
        USB_DESC_TYPE_INTERFACE,   /* bDescriptorType */
        0x02,                      /* bInterfaceNumber = 2 */
        0x00,                      /* bAlternateSetting = 0 */
        0x00,                      /* bNumEndpoints = 0 */
        0x01,
        0x02,
        0x00, /* AUDIO, AUDIO_STREAMING */
        0x00,
        /* 09 byte(212)*/

        /* Std AS Interface, alt 1 (48kHz) */
        AUDIO_INTERFACE_DESC_SIZE,     /* bLength */
        USB_DESC_TYPE_INTERFACE,       /* bDescriptorType */
        0x02,                          /* bInterfaceNumber = 2 */
        0x01,                          /* bAlternateSetting = 1 */
        0x01,                          /* bNumEndpoints = 1 (IN) */
        USB_DEVICE_CLASS_AUDIO,        /* bInterfaceClass */
        AUDIO_SUBCLASS_AUDIOSTREAMING, /* bInterfaceSubClass */
        AUDIO_PROTOCOL_UNDEFINED,      /* bInterfaceProtocol */
        0x00,                          /* iInterface */
        /* 09 byte(221)*/

