yamamo2shun1/OTO_DEVICES/STM32CubeIDE/USB_HS_TEST/Middlewares/ST/STM32_USB_Device_Library/Class/AUDIO/Src/usbd_audio.c
        /* CS AS General (link to OT USB Streaming = 0x13) */
        AUDIO_STREAMING_INTERFACE_DESC_SIZE, /* bLength */
        AUDIO_INTERFACE_DESCRIPTOR_TYPE,     /* bDescriptorType */
        0x01,                                /* bLength=7, CS_INTERFACE, AS_GENERAL */
        0x13,                                /* bTerminalLink = 0x13 */
        0x01,                                /* bDelay */
        0x01,
        0x00, /* wFormatTag = PCM */
        /* 07 byte(228)*/

        /* Type I Format (2ch, 24bit, 48kHz) */
        0x0B,                               /* bLength */
        AUDIO_INTERFACE_DESCRIPTOR_TYPE,    /* bDescriptorType */
        AUDIO_STREAMING_FORMAT_TYPE,        /* bDescriptorSubtype */
        AUDIO_FORMAT_TYPE_I,                /* bFormatType */
        USBD_AUDIO_CHANNELS,                /* bNrChannels */
        USBD_AUDIO_SUBFRAME_BYTES,          /* bSubFrameSize :  3 Bytes per frame (24bits) */
        USBD_AUDIO_RES_BITS,                /* bBitResolution (24-bits per sample) */
        0x01,                               /* bSamFreqType only one frequency supported */
        AUDIO_SAMPLE_FREQ(USBD_AUDIO_FREQ), /* Audio sampling frequency coded on 3 bytes */
                                            /* 11 byte(239)*/

        /* Std ISO Endpoint (IN) 0x81, Async (0x05), 1ms, 288B */
        AUDIO_STANDARD_ENDPOINT_DESC_SIZE,      /* bLength */
        USB_DESC_TYPE_ENDPOINT,                 /* bDescriptorType: ENDPOINT */
        AUDIO_IN_EP,                            /* bEndpointAddress = 0x81 (IN) */
        0x05,                                   /* bmAttributes = Isochronous | Asynchronous | Data */
        AUDIO_PACKET_SIZE_MAX(USBD_AUDIO_FREQ), /* wMaxPacketSize in Bytes (Freq(Samples)*2(Stereo)*3(Word)) */
        AUDIO_HS_BINTERVAL,                     /* bInterval */
        0x00,                                   /* bRefresh */
        0x00,                                   /* bSynchAddress */
        /* 09 byte(248)*/

        /* CS ISO Endpoint (IN) */
        AUDIO_STREAMING_ENDPOINT_DESC_SIZE, /* bLength */
        AUDIO_ENDPOINT_DESCRIPTOR_TYPE,     /* bDescriptorType */
        AUDIO_ENDPOINT_GENERAL,             /* bDescriptor */
        0x00,                               /* bmAttributes */
        0x00,                               /* bLockDelayUnits */
        0x00,
        0x00, /* wLockDelay */
              /* 07 byte(255)*/

        /* Std AS Interface, alt 2 (96kHz) */
        AUDIO_INTERFACE_DESC_SIZE,     /* bLength */
        USB_DESC_TYPE_INTERFACE,       /* bDescriptorType */
        0x02,                          /* bInterfaceNumber = 2 */
        0x02,                          /* bAlternateSetting = 2 */
        0x02,                          /* bNumEndpoints = 1 (IN) */
        USB_DEVICE_CLASS_AUDIO,        /* bInterfaceClass */
        AUDIO_SUBCLASS_AUDIOSTREAMING, /* bInterfaceSubClass */
        AUDIO_PROTOCOL_UNDEFINED,      /* bInterfaceProtocol */
        0x00,                          /* iInterface */
        /* 09 byte(264)*/

        /* CS AS General (link to OT USB Streaming = 0x13) */
        AUDIO_STREAMING_INTERFACE_DESC_SIZE, /* bLength */
        AUDIO_INTERFACE_DESCRIPTOR_TYPE,     /* bDescriptorType */
        0x01,
        0x13,
        0x01,
        0x01,
        0x00,
        /* 07 byte(271)*/

        /* Type I Format (2ch, 24bit, 96kHz) */
        0x0B,                                   /* bLength */
        AUDIO_INTERFACE_DESCRIPTOR_TYPE,        /* bDescriptorType */
        AUDIO_STREAMING_FORMAT_TYPE,            /* bDescriptorSubtype */
        AUDIO_FORMAT_TYPE_I,                    /* bFormatType */
        USBD_AUDIO_CHANNELS,                    /* bNrChannels */
        USBD_AUDIO_SUBFRAME_BYTES,              /* bSubFrameSize :  3 Bytes per frame (24bits) */
        USBD_AUDIO_RES_BITS,                    /* bBitResolution (24-bits per sample) */
        0x01,                                   /* bSamFreqType only one frequency supported */
        AUDIO_SAMPLE_FREQ(USBD_AUDIO_FREQ_96K), /* Audio sampling frequency coded on 3 bytes */
        /* 11 byte(282)*/

        /* Std ISO Endpoint (IN), wMaxPacketSize=576B */
        AUDIO_STANDARD_ENDPOINT_DESC_SIZE,          /* bLength */
        USB_DESC_TYPE_ENDPOINT,                     /* bDescriptorType: ENDPOINT */
        AUDIO_IN_EP,                                /* bEndpointAddress = 0x81 (IN) */
        0x05,                                       /* bmAttributes = Isochronous | Asynchronous | Data */
        AUDIO_PACKET_SIZE_MAX(USBD_AUDIO_FREQ_96K), /* wMaxPacketSize in Bytes (Freq(Samples)*2(Stereo)*3(Word)) */
        AUDIO_HS_BINTERVAL,                         /* bInterval */
        0x00,                                       /* bRefresh */
        0x00,                                       /* bSynchAddress */
        /* 9 byte(291)*/

        /* CS ISO Endpoint */
        AUDIO_STREAMING_ENDPOINT_DESC_SIZE, /* bLength */
        AUDIO_ENDPOINT_DESCRIPTOR_TYPE,     /* bDescriptorType */
        AUDIO_ENDPOINT_GENERAL,             /* bDescriptor */
        0x00,                               /* bmAttributes */
        0x00,                               /* bLockDelayUnits */
        0x00,
        0x00 /* wLockDelay */
             /* 7 byte(298)*/
};

/* USB Standard Device Descriptor */
__ALIGN_BEGIN static uint8_t USBD_AUDIO_DeviceQualifierDesc[USB_LEN_DEV_QUALIFIER_DESC] __ALIGN_END =
    {
        USB_LEN_DEV_QUALIFIER_DESC,
        USB_DESC_TYPE_DEVICE_QUALIFIER,
        0x00,
        0x02,
        0x00,
        0x00,
        0x00,
        0x40,
        0x01,
        0x00,
};
#endif /* USE_USBD_COMPOSITE  */

static uint8_t AUDIOOutEpAdd = AUDIO_OUT_EP;
static uint8_t AUDIOFbEpAdd  = AUDIO_FB_EP;
static uint8_t AUDIOInEpAdd  = AUDIO_IN_EP;
/**
 * @}
 */

/** @defgroup USBD_AUDIO_Private_Functions
 * @{
 */

/**
 * @brief  USBD_AUDIO_Init
 *         Initialize the AUDIO interface
 * @param  pdev: device instance
 * @param  cfgidx: Configuration index
 * @retval status
 */
static uint8_t USBD_AUDIO_Init(USBD_HandleTypeDef* pdev, uint8_t cfgidx)
{
    UNUSED(cfgidx);
    USBD_AUDIO_HandleTypeDef* haudio;

