yamamo2shun1/OTO_DEVICES/STM32CubeIDE/USB_HS_TEST/Middlewares/ST/STM32_USB_Device_Library/Class/AUDIO/Src/usbd_audio.c
            uint8_t ifnum = (uint8_t) (req->wIndex & 0xFF);
            uint8_t alt   = (uint8_t) (req->wValue & 0xFF);

            haudio->alt_setting = alt;  // 既存の動作を踏襲

            /* ---- Speaker: Interface #1 (OUT) ---- */
            if (ifnum == 0x01)
            {
                if (alt == 1 || alt == 2)
                {
                    /* 再生開始に備えてリングを初期化し、受信をプライム */
                    const uint16_t mps = (alt == 2U) ? AUDIO_OUT_PACKET_96K : AUDIO_OUT_PACKET;
                    haudio->wr_ptr     = 0U;
                    haudio->rd_ptr     = 0U;
                    haudio->rd_enable  = 0U;
                    haudio->offset     = AUDIO_OFFSET_UNKNOWN;

                    printf("alt = %d, mps = %d\n", alt, mps);

                    (void) USBD_LL_CloseEP(pdev, AUDIOOutEpAdd);
                    pdev->ep_out[AUDIOOutEpAdd & 0xF].is_used = 0U;
                    (void) USBD_LL_OpenEP(pdev, AUDIOOutEpAdd, USBD_EP_TYPE_ISOC, mps);
                    pdev->ep_out[AUDIOOutEpAdd & 0xF].is_used = 1U;

                    /* 受信EPをフラッシュしてから最初の受信を投入 */
                    USBD_LL_FlushEP(pdev, AUDIOOutEpAdd);
                    (void) USBD_LL_PrepareReceive(pdev, AUDIOOutEpAdd, &haudio->buffer[haudio->wr_ptr], mps);

                    pdev->ep_in[AUDIOFbEpAdd & 0xF].bInterval = AUDIO_FB_BINTERVAL;

                    USBD_LL_OpenEP(pdev, AUDIOFbEpAdd, USBD_EP_TYPE_ISOC, 3);  // 3 bytes
                    pdev->ep_in[AUDIOFbEpAdd & 0xF].is_used   = 1U;
                    pdev->ep_in[AUDIOFbEpAdd & 0xF].maxpacket = 3U;

                    s_fb_busy   = 0; /* ★ busy解除 */
                    s_fb_opened = 1;

                    AUDIO_SAI_Reset_ForNewRate((alt == 2U) ? USBD_AUDIO_FREQ_96K : USBD_AUDIO_FREQ);

                    /* ★ 初回プライム：直近の値を用意して1発アーム */
                    AUDIO_FB_Task_1ms(alt); /* 値だけ用意 */
                    s_fb_arm_pending = 1;
                }
                else
                {
                    /* Alt=0 に戻る場合はEPをフラッシュ */
                    USBD_LL_FlushEP(pdev, AUDIOOutEpAdd);

                    USBD_LL_CloseEP(pdev, AUDIOFbEpAdd);
                    pdev->ep_in[AUDIOFbEpAdd & 0xF].is_used   = 0U;
                    pdev->ep_in[AUDIOFbEpAdd & 0xF].maxpacket = 0U;

                    s_fb_busy        = 0; /* ★ busy解除 */
                    s_fb_opened      = 0;
                    s_fb_arm_pending = 0;
                }
            }

            /* ---- Mic: Interface #2 ---- */
            if (ifnum == 0x02)
            {
    #ifdef USE_USBD_COMPOSITE
                AUDIOInEpAdd = USBD_CoreGetEPAdd(pdev, USBD_EP_IN, USBD_EP_TYPE_ISOC, (uint8_t) pdev->classId);
    #endif

                if (alt == 1 || alt == 2)
                {
                    /* IN EP open（Alt=1運用開始） */
                    if (pdev->dev_speed == USBD_SPEED_HIGH)
                    {
                        pdev->ep_in[AUDIOInEpAdd & 0xFU].bInterval = AUDIO_HS_BINTERVAL;  // HSは通常 4 (=1ms)
                    }
                    else
                    {
                        pdev->ep_in[AUDIOInEpAdd & 0xFU].bInterval = AUDIO_FS_BINTERVAL;  // FSは 1 (=1ms)
                    }
                    const uint16_t mps = (alt == 2U) ? AUDIO_IN_PACKET_96K : AUDIO_IN_PACKET;
                    (void) USBD_LL_OpenEP(pdev, AUDIOInEpAdd, USBD_EP_TYPE_ISOC, mps);
                    pdev->ep_in[AUDIOInEpAdd & 0xFU].is_used = 1U;

                    haudio->mic_prime = 1;

                    s_fb_opened_in = 1;
                }
                else
                {
                    /* Alt=0: IN EP停止 */
                    (void) USBD_LL_CloseEP(pdev, AUDIOInEpAdd);
                    pdev->ep_in[AUDIOInEpAdd & 0xFU].is_used   = 0U;
                    pdev->ep_in[AUDIOInEpAdd & 0xFU].bInterval = 0U;

                    s_fb_opened_in = 0;
                }
            }

            /* 標準リクエストの応答 */
            (void) USBD_CtlSendStatus(pdev);
#endif
            break;

        case USB_REQ_CLEAR_FEATURE:
            break;

        default:
            USBD_CtlError(pdev, req);
            ret = USBD_FAIL;
            break;
        }
        break;
    default:
        USBD_CtlError(pdev, req);
        ret = USBD_FAIL;
        break;
    }

    return (uint8_t) ret;
}

#ifndef USE_USBD_COMPOSITE
/**
 * @brief  USBD_AUDIO_GetCfgDesc
 *         return configuration descriptor
 * @param  length : pointer data length
 * @retval pointer to descriptor buffer
 */
static uint8_t* USBD_AUDIO_GetCfgDesc(uint16_t* length)
{
    *length = (uint16_t) sizeof(USBD_AUDIO_CfgDesc);

    return USBD_AUDIO_CfgDesc;
}
#endif /* USE_USBD_COMPOSITE  */
/**
 * @brief  USBD_AUDIO_DataIn
 *         handle data IN Stage
 * @param  pdev: device instance
 * @param  epnum: endpoint index
 * @retval status
 */
static uint8_t USBD_AUDIO_DataIn(USBD_HandleTypeDef* pdev, uint8_t epnum)
{
    USBD_AUDIO_HandleTypeDef* haudio;
    haudio = (USBD_AUDIO_HandleTypeDef*) pdev->pClassDataCmsit[pdev->classId];

#if 0
    if (pdev->dev_state != USBD_STATE_CONFIGURED)
        return (uint8_t) USBD_OK;
#endif
    if ((epnum & 0x0F) == (AUDIOInEpAdd & 0x0F))
    {
        if (haudio->alt_setting == 1)
        {
            (void) AUDIO_Mic_GetPacket(mic_packet, AUDIO_IN_PACKET);
            (void) USBD_LL_Transmit(pdev, AUDIOInEpAdd, mic_packet, AUDIO_IN_PACKET);
        }
        else if (haudio->alt_setting == 2)
        {
            (void) AUDIO_Mic_GetPacket(mic_packet, AUDIO_IN_PACKET_96K);
            (void) USBD_LL_Transmit(pdev, AUDIOInEpAdd, mic_packet, AUDIO_IN_PACKET_96K);
        }

        // printf("data in!\n");
    }

    /* epnum は EP番号(0..15)。アドレスではない点に注意 */
    if ((epnum & 0x0F) == (AUDIOFbEpAdd & 0x0F))
    {
        s_fb_busy = 0; /* ★ 完了で busy を確実に落とす */
        g_fb_ack++;    /* ★ ACK をカウント */

        /* ★ ACKが来たら、その場で次回分をアーム */
        if (!s_fb_arm_pending)
        {
            s_fb_arm_pending = 1;
        }

        return (uint8_t) USBD_OK;
    }

    /* Only OUT data are processed */
    return (uint8_t) USBD_OK;
}

/**
 * @brief  USBD_AUDIO_EP0_RxReady
 *         handle EP0 Rx Ready event
 * @param  pdev: device instance
 * @retval status
 */
static uint8_t USBD_AUDIO_EP0_RxReady(USBD_HandleTypeDef* pdev)
{
    USBD_AUDIO_HandleTypeDef* haudio;
    haudio = (USBD_AUDIO_HandleTypeDef*) pdev->pClassDataCmsit[pdev->classId];

    if (haudio == NULL)
    {
        return (uint8_t) USBD_FAIL;
    }

