yamamo2shun1/OTO_DEVICES/STM32CubeIDE/USB_HS_TEST/Middlewares/ST/STM32_USB_Device_Library/Class/AUDIO/Src/usbd_audio.c
    if (haudio->control.cmd == AUDIO_REQ_SET_CUR)
    {
        /* In this driver, to simplify code, only SET_CUR request is managed */

        if (haudio->control.unit == AUDIO_OUT_STREAMING_CTRL)
        {
            ((USBD_AUDIO_ItfTypeDef*) pdev->pUserData[pdev->classId])->MuteCtl(haudio->control.data[0]);
            haudio->control.cmd = 0U;
            haudio->control.len = 0U;
        }
    }

    return (uint8_t) USBD_OK;
}
/**
 * @brief  USBD_AUDIO_EP0_TxReady
 *         handle EP0 TRx Ready event
 * @param  pdev: device instance
 * @retval status
 */
static uint8_t USBD_AUDIO_EP0_TxReady(USBD_HandleTypeDef* pdev)
{
    UNUSED(pdev);

    /* Only OUT control data are processed */
    return (uint8_t) USBD_OK;
}
/**
 * @brief  USBD_AUDIO_SOF
 *         handle SOF event
 * @param  pdev: device instance
 * @retval status
 */
static uint8_t USBD_AUDIO_SOF(USBD_HandleTypeDef* pdev)
{
    static int8_t s_fb_poll_uframe = -1;

    USBD_EndpointTypeDef ep = pdev->ep_in[AUDIOFbEpAdd & 0xF];
    if (pdev->dev_state != USBD_STATE_CONFIGURED || !ep.is_used || ep.maxpacket == 0)
        return (uint8_t) USBD_OK;

#if 1
    if (pdev && pdev->dev_state == USBD_STATE_CONFIGURED && s_fb_opened)
    {
        uint8_t uf      = USBD_GetMicroframeHS();
        bool poll_match = (s_fb_poll_uframe < 0) ? (uf == 0) : (uf == (uint8_t) s_fb_poll_uframe);
        if (s_fb_arm_pending && !s_fb_busy && poll_match)
        {
            USBD_AUDIO_HandleTypeDef* haudio = (USBD_AUDIO_HandleTypeDef*) pdev->pClassDataCmsit[pdev->classId];
            AUDIO_FB_Task_1ms(haudio->alt_setting);
            __DMB();
            if (USBD_LL_Transmit(pdev, AUDIOFbEpAdd, s_fb_pkt, 3) == USBD_OK)
            {
                s_fb_busy        = 1;
                s_fb_arm_pending = 0;
                g_fb_tx_req++;
                g_fb_tx_ok++;

                // 初回成功で“ホストが実際にポーリングしていたµframe”を学習
                if (s_fb_poll_uframe < 0)
                {
                    s_fb_poll_uframe = (int8_t) uf;
                }
            }
            else
            {
                g_fb_tx_busy++;
            }
    #if 0
            static uint32_t last = 0;
            uint32_t now         = HAL_GetTick();
            if ((now - last) >= 1000)
            {
                USB_OTG_INEndpointTypeDef* in =
                    (USB_OTG_INEndpointTypeDef*) ((uint32_t) USB_OTG_HS + USB_OTG_IN_ENDPOINT_BASE);
                uint8_t idx = (uint8_t) (AUDIOFbEpAdd & 0x0F);
                printf("[FB:sof] DIEPCTL=0x%08lX DIEPTSIZ=0x%08lX\n", (unsigned long) in[idx].DIEPCTL, (unsigned long) in[idx].DIEPTSIZ);
                last = now;
            }
    #endif

    #if 0
            static uint32_t last_ms = 0;
            const uint32_t now      = HAL_GetTick();
            if ((now - last_ms) >= 1000)
            {
                AUDIO_Stats_On1sTick(); /* ← 1秒境界で確定 */
                AUDIO_Stats st;
                AUDIO_GetStats(&st);
                printf("[AUDIO] cap=%u frm, level[now/min/max]=%u/%u/%u, "
                       "fps[in/out]=%u/%u, dLevel/s=%ld, "
                       "UR(ev=%u,frm=%u), OR(ev=%u,frm=%u), copy_us(last=%u,max=%u)\n",
                       st.rxq_capacity_frames, st.rxq_level_now, st.rxq_level_min, st.rxq_level_max, st.in_fps, st.out_fps, (long) st.dlevel_per_s, st.underrun_events, st.underrun_frames, st.overrun_events, st.overrun_frames, st.copy_us_last, st.copy_us_max);

                last_ms = now;
            }
    #endif
        }
    }
#endif

    if (s_fb_opened_in)
    {
        USBD_AUDIO_HandleTypeDef* haudio = (USBD_AUDIO_HandleTypeDef*) pdev->pClassDataCmsit[pdev->classId];
        if (!haudio)
        {
            return (uint8_t) USBD_OK;
        }

        /* alt=1 が選択され、まだ初回送信していない？ */
        if (haudio->alt_setting == 1 && haudio->mic_prime)
        {
            /* いったんフラッシュして、フレーム境界(1ms)に揃えて送る */
            USBD_LL_FlushEP(pdev, AUDIOInEpAdd);
            AUDIO_Mic_GetPacket(mic_packet, AUDIO_IN_PACKET);
            USBD_LL_Transmit(pdev, AUDIOInEpAdd, mic_packet, AUDIO_IN_PACKET);
            haudio->mic_prime = 0;

            printf("first transmit(48k).\n");
        }
        else if (haudio->alt_setting == 2 && haudio->mic_prime)
        {
            /* いったんフラッシュして、フレーム境界(1ms)に揃えて送る */
            USBD_LL_FlushEP(pdev, AUDIOInEpAdd);
            AUDIO_Mic_GetPacket(mic_packet, AUDIO_IN_PACKET_96K);
            USBD_LL_Transmit(pdev, AUDIOInEpAdd, mic_packet, AUDIO_IN_PACKET_96K);
            haudio->mic_prime = 0;

            printf("first transmit(96k).\n");
        }
    }

    return (uint8_t) USBD_OK;
}

/**
 * @brief  USBD_AUDIO_SOF
 *         handle SOF event
 * @param  pdev: device instance
 * @param  offset: audio offset
 * @retval status
 */
void USBD_AUDIO_Sync(USBD_HandleTypeDef* pdev, AUDIO_OffsetTypeDef offset)
{
    USBD_AUDIO_HandleTypeDef* haudio;
    uint32_t BufferSize = AUDIO_TOTAL_BUF_SIZE / 2U;

    if (pdev->pClassDataCmsit[pdev->classId] == NULL)
    {
        return;
    }

    haudio = (USBD_AUDIO_HandleTypeDef*) pdev->pClassDataCmsit[pdev->classId];

    haudio->offset = offset;

    if (haudio->rd_enable == 1U)
    {
        haudio->rd_ptr += (uint16_t) BufferSize;

        if (haudio->rd_ptr == AUDIO_TOTAL_BUF_SIZE)
        {
            /* roll back */
            haudio->rd_ptr = 0U;
        }
    }

    if (haudio->rd_ptr > haudio->wr_ptr)
    {
        if ((haudio->rd_ptr - haudio->wr_ptr) < AUDIO_OUT_PACKET)
        {
            BufferSize += 4U;
        }
        else
        {
            if ((haudio->rd_ptr - haudio->wr_ptr) > (AUDIO_TOTAL_BUF_SIZE - AUDIO_OUT_PACKET))
            {
                BufferSize -= 4U;
            }
        }
    }
    else
    {
        if ((haudio->wr_ptr - haudio->rd_ptr) < AUDIO_OUT_PACKET)
        {
            BufferSize -= 4U;
        }
        else
        {
            if ((haudio->wr_ptr - haudio->rd_ptr) > (AUDIO_TOTAL_BUF_SIZE - AUDIO_OUT_PACKET))
            {
                BufferSize += 4U;
            }
        }
    }

    if (haudio->offset == AUDIO_OFFSET_FULL)
    {
        ((USBD_AUDIO_ItfTypeDef*) pdev->pUserData[pdev->classId])->AudioCmd(&haudio->buffer[0], BufferSize, AUDIO_CMD_PLAY);
        haudio->offset = AUDIO_OFFSET_NONE;
    }
}

/**
 * @brief  USBD_AUDIO_IsoINIncomplete
 *         handle data ISO IN Incomplete event
 * @param  pdev: device instance
 * @param  epnum: endpoint index
 * @retval status
 */
#include "stm32h7rsxx_ll_usb.h"
#define USB_OTG_BASE_ADDRESS USB_OTG_HS

#define USB_DIEPCTL(ep_addr) ((USB_OTG_INEndpointTypeDef*) ((uint32_t) USB_OTG_BASE_ADDRESS + USB_OTG_IN_ENDPOINT_BASE + (ep_addr & 0x7FU) * USB_OTG_EP_REG_SIZE))->DIEPCTL
#define USB_DOEPCTL(ep_addr) ((USB_OTG_OUTEndpointTypeDef*) ((uint32_t) USB_OTG_BASE_ADDRESS + USB_OTG_OUT_ENDPOINT_BASE + (ep_addr) * USB_OTG_EP_REG_SIZE))->DOEPCTL

