yamamo2shun1/OTO_DEVICES/STM32CubeIDE/USB_HS_TEST/Middlewares/ST/STM32_USB_Device_Library/Class/AUDIO/Src/usbd_audio.c
#define USB_CLEAR_INCOMPLETE_IN_EP(ep_addr)                                     \
    if ((((ep_addr) & 0x80U) == 0x80U))                                         \
    {                                                                           \
        USB_DIEPCTL(ep_addr) |= (USB_OTG_DIEPCTL_EPDIS | USB_OTG_DIEPCTL_SNAK); \
    };

static uint8_t USBD_AUDIO_IsoINIncomplete(USBD_HandleTypeDef* pdev, uint8_t epnum)
{
    USBD_AUDIO_HandleTypeDef* haudio;
    haudio = (USBD_AUDIO_HandleTypeDef*) pdev->pClassDataCmsit[pdev->classId];

    if ((epnum & 0x0F) == (AUDIOInEpAdd & 0x0F))
    {
        if (haudio->alt_setting == 1)
        {
            (void) USBD_LL_Transmit(pdev, AUDIOInEpAdd, mic_packet, AUDIO_IN_PACKET);
        }
        else if (haudio->alt_setting == 2)
        {
            (void) USBD_LL_Transmit(pdev, AUDIOInEpAdd, mic_packet, AUDIO_IN_PACKET_96K);
        }

        // printf("incomplete...\n");
    }

    if ((epnum & 0x0F) == (AUDIOFbEpAdd & 0x0F))
    {
        s_fb_busy = 0; /* ★ 完了しなくても次回送れるように busy を解放 */
        g_fb_incomp++;

        USB_CLEAR_INCOMPLETE_IN_EP(AUDIOFbEpAdd);
        USBD_LL_FlushEP(pdev, AUDIOFbEpAdd);
        __DMB();

        /* ★ 未成立でも“すぐ次回分”をアーム（次のmsで間に合うよう先行） */
        if (!s_fb_arm_pending)
        {
            s_fb_arm_pending = 1;
        }
    }

    return (uint8_t) USBD_OK;
}
/**
 * @brief  USBD_AUDIO_IsoOutIncomplete
 *         handle data ISO OUT Incomplete event
 * @param  pdev: device instance
 * @param  epnum: endpoint index
 * @retval status
 */
static uint8_t USBD_AUDIO_IsoOutIncomplete(USBD_HandleTypeDef* pdev, uint8_t epnum)
{
    USBD_AUDIO_HandleTypeDef* haudio;

    if (pdev->pClassDataCmsit[pdev->classId] == NULL)
    {
        return (uint8_t) USBD_FAIL;
    }

    haudio = (USBD_AUDIO_HandleTypeDef*) pdev->pClassDataCmsit[pdev->classId];

    if ((epnum & 0x0F) == (AUDIOOutEpAdd & 0x0F))
    {
#if 0
        uint32_t USBx_BASE = USB_OTG_HS;
        uint32_t ctl       = USBx_OUTEP(epnum & 0x0f)->DOEPCTL;
        uint32_t siz       = USBx_OUTEP(epnum & 0x0f)->DOEPTSIZ;
        printf("[OUT:INC] DOEPCTL=%08lX DOEPTSIZ=%08lX\n", ctl, siz);
#endif

#if 1
        /* Prepare Out endpoint to receive next audio packet */
        if (haudio->alt_setting == 1)
        {
            (void) USBD_LL_PrepareReceive(pdev, AUDIOOutEpAdd, &haudio->buffer[haudio->wr_ptr], AUDIO_OUT_PACKET);
        }
        else if (haudio->alt_setting == 2)
        {
            (void) USBD_LL_PrepareReceive(pdev, AUDIOOutEpAdd, &haudio->buffer[haudio->wr_ptr], AUDIO_OUT_PACKET_96K);
        }
#endif
    }

    return (uint8_t) USBD_OK;
}
/**
 * @brief  USBD_AUDIO_DataOut
 *         handle data OUT Stage
 * @param  pdev: device instance
 * @param  epnum: endpoint index
 * @retval status
 */
static uint8_t USBD_AUDIO_DataOut(USBD_HandleTypeDef* pdev, uint8_t epnum)
{
    uint16_t PacketSize;
    USBD_AUDIO_HandleTypeDef* haudio;

#ifdef USE_USBD_COMPOSITE
    /* Get the Endpoints addresses allocated for this class instance */
    AUDIOOutEpAdd = USBD_CoreGetEPAdd(pdev, USBD_EP_OUT, USBD_EP_TYPE_ISOC, (uint8_t) pdev->classId);
#endif /* USE_USBD_COMPOSITE */

    haudio = (USBD_AUDIO_HandleTypeDef*) pdev->pClassDataCmsit[pdev->classId];

    if (haudio == NULL)
    {
        return (uint8_t) USBD_FAIL;
    }

    if ((epnum & 0x0F) == (AUDIOOutEpAdd & 0x0F))
    {
        /* Get received data packet length */
        PacketSize = (uint16_t) USBD_LL_GetRxDataSize(pdev, AUDIOOutEpAdd);

        /* Packet received Callback */
        ((USBD_AUDIO_ItfTypeDef*) pdev->pUserData[pdev->classId])->PeriodicTC(&haudio->buffer[haudio->wr_ptr], PacketSize, AUDIO_OUT_TC);

        /* Increment the Buffer pointer or roll it back when all buffers are full */
        haudio->wr_ptr += PacketSize;

        if (haudio->wr_ptr >= AUDIO_TOTAL_BUF_SIZE - PacketSize)
        {
            /* All buffers are full: roll back */
            haudio->wr_ptr = 0U;

            if (haudio->offset == AUDIO_OFFSET_UNKNOWN)
            {
                ((USBD_AUDIO_ItfTypeDef*) pdev->pUserData[pdev->classId])->AudioCmd(&haudio->buffer[0], AUDIO_TOTAL_BUF_SIZE / 2U, AUDIO_CMD_START);
                haudio->offset = AUDIO_OFFSET_NONE;
            }
        }

        if (haudio->rd_enable == 0U)
        {
            if (haudio->wr_ptr == (AUDIO_TOTAL_BUF_SIZE / 2U))
            {
                haudio->rd_enable = 1U;
            }
        }

        /* Prepare Out endpoint to receive next audio packet */
        (void) USBD_LL_PrepareReceive(pdev, AUDIOOutEpAdd, &haudio->buffer[haudio->wr_ptr], PacketSize);
    }

    return (uint8_t) USBD_OK;
}

/**
 * @brief  AUDIO_Req_GetCurrent
 *         Handles the GET_CUR Audio control request.
 * @param  pdev: device instance
 * @param  req: setup class request
 * @retval status
 */
static void AUDIO_REQ_GetCurrent(USBD_HandleTypeDef* pdev, USBD_SetupReqTypedef* req)
{
    USBD_AUDIO_HandleTypeDef* haudio;
    haudio = (USBD_AUDIO_HandleTypeDef*) pdev->pClassDataCmsit[pdev->classId];

    if (haudio == NULL)
    {
        return;
    }

    (void) USBD_memset(haudio->control.data, 0, USB_MAX_EP0_SIZE);

    /* Send the current mute state */
    (void) USBD_CtlSendData(pdev, haudio->control.data, MIN(req->wLength, USB_MAX_EP0_SIZE));
}

/**
 * @brief  AUDIO_Req_SetCurrent
 *         Handles the SET_CUR Audio control request.
 * @param  pdev: device instance
 * @param  req: setup class request
 * @retval status
 */
static void AUDIO_REQ_SetCurrent(USBD_HandleTypeDef* pdev, USBD_SetupReqTypedef* req)
{
    USBD_AUDIO_HandleTypeDef* haudio;
    haudio = (USBD_AUDIO_HandleTypeDef*) pdev->pClassDataCmsit[pdev->classId];

    if (haudio == NULL)
    {
        return;
    }

    if (req->wLength != 0U)
    {
        haudio->control.cmd  = AUDIO_REQ_SET_CUR;                             /* Set the request value */
        haudio->control.len  = (uint8_t) MIN(req->wLength, USB_MAX_EP0_SIZE); /* Set the request data length */
        haudio->control.unit = HIBYTE(req->wIndex);                           /* Set the request target unit */

        /* Prepare the reception of the buffer over EP0 */
        (void) USBD_CtlPrepareRx(pdev, haudio->control.data, haudio->control.len);
    }
}

